# specify a directory to install
cask_args appdir: '/Applications'

brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'rbenv'
brew 'nvm'
brew 'tree'
cask 'gitup'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'

brew 'autojump'
brew 'yarn'
brew 'phantomjs'
brew 'diff-so-fancy'
brew 'the_silver_searcher'

brew 'postgresql', restart_service: true
brew 'rabbitmq', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'
brew 'mongodb'
brew 'mysql'

brew 'erlang'
brew 'elixir'
brew 'node'
brew 'elm'

brew 'libpng'
brew 'jpeg'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'ffmpeg'
brew 'libtool'
brew 'webp'
brew 'imagemagick', args: ['with-webp']
brew 'libssh'
brew 'libxml2'
brew 'libxslt'
brew 'openjpeg'
brew 'webkit2png'

brew 'cmake'
brew 'coreutils'

tap 'homebrew/dupes'
brew 'homebrew/dupes/libiconv'
brew 'homebrew/dupes/zlib'

cask 'firefox'
cask 'google-chrome'

cask 'coconutbattery'
cask 'gpgtools'
cask 'grammarly'
cask 'rescuetime'
cask 'spectacle'
cask 'typora'
cask 'muzzle'
cask 'appcleaner'

brew 'mas'
mas 'Amphetamine', id: 937984704
mas 'TheUnarchiver', id: 425424353

cask 'skype'
cask 'slack'

cask 'licecap'
cask 'iterm2'
cask 'insomnia'
cask 'sublime-text'
cask 'sequel-pro'
cask 'psequel'
cask 'docker'

cask 'spotify'

tap 'caskroom/fonts'
cask 'font-fira-code'
cask 'font-hack'
