# specify a directory to install
cask_args appdir: '/Applications'

brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'rbenv'
brew 'nvm'
brew 'tree'
cask 'gitup'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'
brew 'tfenv'
brew 'tldr'

brew 'vim'
brew 'autojump'
brew 'yarn'
cask 'phantomjs'
cask 'chromedriver'
brew 'diff-so-fancy'
brew 'the_silver_searcher'
brew 'mkcert'
brew 'nss'
brew 'direnv'

brew 'postgresql', restart_service: true
brew 'rabbitmq', restart_service: true
brew 'redis', restart_service: true
brew 'sqlite'
brew 'mysql'
tap 'homebrew/cask-versions'
cask 'adoptopenjdk8'
brew 'kafka'

brew 'libpng'
brew 'jpeg'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'ffmpeg'
brew 'libtool'
brew 'webp'
brew 'imagemagick'
brew 'libssh'
brew 'libxml2'
brew 'libxslt'
brew 'openjpeg'
brew 'webkit2png'

brew 'cmake'
brew 'coreutils'

brew 'libiconv'
brew 'zlib'

brew 'awscli'
brew 'jq'

cask 'firefox'
cask 'google-chrome'

cask 'gpg-suite'
cask 'spectacle'
cask 'muzzle'
cask 'appcleaner'

brew 'mas'
mas 'TheUnarchiver', id: 425424353
mas 'Amphetamine', id: 937984704
mas 'Keynote', id: 409183694
mas 'MindNode', id: 1289197285
mas 'Dato', id: 1470584107

cask 'skype'
cask 'slack'

cask 'kap'
cask 'iterm2'
cask 'insomnia'
cask 'sublime-text'
cask 'sequel-pro'
cask 'postico'
cask 'docker'
cask 'typora'
cask 'deckset'
cask 'dash'

cask 'spotify'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-roboto-mono'
