# specify a directory to install
cask_args appdir: '/Applications'

brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'rbenv'
brew 'asdf'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'
brew 'fzf'
brew 'tfenv'
brew 'tldr'

brew 'vim'
brew 'autojump'
brew 'diff-so-fancy'
brew 'the_silver_searcher'
brew 'mkcert'
brew 'nss'
brew 'direnv'
brew 'pure'

brew 'postgresql', restart_service: true

brew 'libpng'
brew 'jpeg'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'ffmpeg'
brew 'libtool'
brew 'webp'
brew 'imagemagick'
brew 'libssh'
brew 'libxml2'
brew 'libxslt'
brew 'openjpeg'
brew 'webkit2png'

brew 'cmake'
brew 'coreutils'

brew 'libiconv'
brew 'zlib'

brew 'awscli'
tap 'versent/homebrew-taps'
brew 'saml2aws'
brew 'jq'

cask 'google-chrome'

cask 'gpg-suite'
cask 'rectangle'
cask 'appcleaner'
cask 'karabiner-elements'

brew 'mas'
mas 'TheUnarchiver', id: 425424353
mas 'Amphetamine', id: 937984704
mas 'Keynote', id: 409183694
mas 'MindNode', id: 1289197285

cask 'slack'
cask 'notion'
cask 'zoom'
cask 'figma'
cask 'discord'
cask 'nordvpn'

cask 'insomnia'
cask 'sublime-text'
cask 'sequel-pro'
cask 'postico'
cask 'docker'
cask 'deckset'
cask 'dash'
cask 'kitty'

tap 'homebrew/cask-fonts'
cask 'font-fira-code'
